Что нужно сделать
Опиши элементы, которые будешь использовать в тестах, с помощью Page Object.
Протестируй функциональность в Google Chrome и Яндекс.Браузере. Подключи Allure-отчёт.


Регистрация RegisterTest
Проверь:

    Успешную регистрацию.
    Ошибку для некорректного пароля. Минимальный пароль — шесть символов.
---------------------------
Вход LoginTest
Проверь:

    вход по кнопке «Войти в аккаунт» на главной,
    вход через кнопку «Личный кабинет»,
    вход через кнопку в форме регистрации,
    вход через кнопку в форме восстановления пароля.
----------------------------
Переход в личный кабинет LoginTest
Проверь переход по клику на «Личный кабинет».
----------------------------
Переход из личного кабинета в конструктор FromCabinetToConstructorTest
Проверь переход по клику на «Конструктор» и на логотип Stellar Burgers.
----------------------------
Выход из аккаунта LoginTest
Проверь выход по кнопке «Выйти» в личном кабинете.
----------------------------
Раздел «Конструктор» ConstructorTest
Проверь, что работают переходы к разделам:

    «Булки»,
    «Соусы»,
    «Начинки».